#+TITLE:Processes
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:processes practice for CSC420 Operating Systems Spring 2022 Lyon College
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :results output
#+PROPERTY: header-args:bash :exports both
* Viewing processes statically

  * The ~ps~ program has a lot of options (check ~ps(1)~)

  * [X] Run ~ps~ without options.

    #+name: ps
    #+begin_src bash :results output
      ps
    #+end_src

    #+RESULTS: ps
    :   PID TTY          TIME CMD
    :    10 tty1     00:00:00 bash
    :    11 tty1     00:00:00 ps

  * The result is confusing because you're inside another program now. 
 
  * [X] Open a shell (in Emacs with ~M-x shell~ or a terminal) and type
    ~ps~. You should see something like this:

    #+begin_example
      PID TTY          TIME CMD
    12254 pts/1    00:00:00 bash
    12257 pts/1    00:00:00 ps
    #+end_example

  * *What this means:* 
    - You see two ~PID~ - the shell program and the ~ps~ program
    - ~TTY~ ("teletype") is the /controlling terminal/ for the process
    - ~TIME~ is the amount of CPU time consumed by the process

  * [X] Run ~ps~ again, this time add the option ~x~ 
   
    #+name: psx
    #+begin_src bash :results output

    #+end_src

  * ~ps x~ (no dash!) shows all processes regardless of what terminal
     they are controlled by. ~?~ indicates no terminal (like daemons).

  * [X] How many processes that you own that have no terminal?

     #+name: noterm
     #+begin_src bash :results output

     #+end_src

  * [X] List only the first 5 lines of the ~ps x~ listing.

     #+name: headps
     #+begin_src bash :results output
     
  #+end_src

  * The column ~STAT~ reveals the current status of the process, see
    table [[tab:states]].

    #+name: tab:states
    | STATE | MEANING                                            |
    |-------+----------------------------------------------------|
    | R     | Running or ready to run                            |
    | S     | Sleeping, waiting for an event (e.g. keystroke)    |
    | D     | Uninterruptible sleep, waiting for I/O (e.g. disk) |
    | T     | Stopped, received instruction to stop              |
    | Z     | Zombie child process, abandoned by parent          |
    | <     | High priority (not /nice/ - more CPU time)           |
    | N     | Low priority (/nice/) - served once < are done       |

    There may be more characters denoting exotic process
    characteristics (see ~ps(1)~). E.g. ~s~ is a /session leader/, ~+~ is a
    /foreground/ process, and ~l~ is multi-threaded.

  * [ ] You get even more information with the option ~aux~. Redirect
    the output of ~ps aux~ to a file ~psaux.txt~, and print only the first
    5 lines.

    #+name: aux
    #+begin_src bash :results output
     ps aux | tee psaux.txt | head -5
    #+end_src
  
  * You should see ~PID 1~, the ~init~ program. The ~splash~ options means
    that you can see a splash screen during boot.

  * Table [[tab:aux]] shows some header definitions

    #+name: tab:aux
    | HEADER | MEANING                             |
    |--------+-------------------------------------|
    | USER   | User ID - this is the process owner |
    | %CPU   | CPU usage in percent                |
    | %MEM   | Memory usage in percent             |
    | VSZ    | Virtual memory size                 |
    | RSS    | Resident set size - RAM use in kB   |
    | START  | Process starting time and date      |
   
  * [ ] Why is the CPU usage of ~init~ zero, while the Memory usage is
    non-zero? How much RAM does the program actually use?

    #+begin_quote
    ANSWER: 
    #+end_quote

